src/logs/confiabilidade/cenario1/6%/ack-2/log--2-1000-4.out
Topic to send: test-topic
Topic to acks: -2
Records: 80000
Size:1000
[22:42:48]    __________  ________________ 
[22:42:48]   /  _/ ___/ |/ /  _/_  __/ __/ 
[22:42:48]  _/ // (7 7    // /  / / / _/   
[22:42:48] /___/\___/_/|_/___/ /_/ /___/  
[22:42:48] 
[22:42:48] ver. 2.7.6#20190911-sha1:21f7ca41
[22:42:48] 2019 Copyright(C) Apache Software Foundation
[22:42:48] 
[22:42:48] Ignite documentation: http://ignite.apache.org
[22:42:48] 
[22:42:48] Quiet mode.
[22:42:48]   ^-- Logging by 'JavaLogger [quiet=true, config=null]'
[22:42:48]   ^-- To see **FULL** console log here add -DIGNITE_QUIET=false or "-v" to ignite.{sh|bat}
[22:42:48] 
[22:42:48] OS: Linux 5.0.0-38-generic amd64
[22:42:48] VM information: OpenJDK Runtime Environment 11.0.5+10-post-Ubuntu-0ubuntu1.119.04 Private Build OpenJDK 64-Bit Server VM 11.0.5+10-post-Ubuntu-0ubuntu1.119.04
[22:42:48] Please set system property '-Djava.net.preferIPv4Stack=true' to avoid possible problems in mixed environments.
[22:42:48] Initial heap size is 126MB (should be no less than 512MB, use -Xms512m -Xmx512m).
[22:42:48] Configured plugins:
[22:42:48]   ^-- None
[22:42:48] 
[22:42:48] Configured failure handler: [hnd=StopNodeOrHaltFailureHandler [tryStop=false, timeout=0, super=AbstractFailureHandler [ignoredFailureTypes=[SYSTEM_WORKER_BLOCKED, SYSTEM_CRITICAL_OPERATION_TIMEOUT]]]]
[22:42:48] Message queue limit is set to 0 which may lead to potential OOMEs when running cache operations in FULL_ASYNC or PRIMARY_SYNC modes due to message queues growth on sender and receiver sides.
[22:42:48] Security status [authentication=off, tls/ssl=off]
[22:42:49] REST protocols do not start on client node. To start the protocols on client node set '-DIGNITE_REST_START_ON_CLIENT=true' system property.
[22:42:51] Performance suggestions for grid  (fix if possible)
[22:42:51] To disable, set -DIGNITE_PERFORMANCE_SUGGESTIONS_DISABLED=true
[22:42:51]   ^-- Switch to the most recent 1.8 JVM version
[22:42:51]   ^-- Specify JVM heap max size (add '-Xmx<size>[g|G|m|M|k|K]' to JVM options)
[22:42:51]   ^-- Set max direct memory size if getting 'OOME: Direct buffer memory' (add '-XX:MaxDirectMemorySize=<size>[g|G|m|M|k|K]' to JVM options)
[22:42:51]   ^-- Disable processing of calls to System.gc() (add '-XX:+DisableExplicitGC' to JVM options)
[22:42:51] Refer to this page for more performance suggestions: https://apacheignite.readme.io/docs/jvm-and-system-tuning
[22:42:51] 
[22:42:51] To start Console Management & Monitoring run ignitevisorcmd.{sh|bat}
[22:42:51] 
[22:42:51] Ignite node started OK (id=0c834573)
[22:42:51] Topology snapshot [ver=10, locNode=0c834573, servers=1, clients=1, state=ACTIVE, CPUs=8, offheap=1.5GB, heap=3.9GB]
2277 records sent, 407,3 records/sec (0,39 MB/sec), 2,4 ms avg latency, 2242,0 ms max latency.
3296 records sent, 657,9 records/sec (0,63 MB/sec), 1,5 ms avg latency, 563,0 ms max latency.
2190 records sent, 436,9 records/sec (0,42 MB/sec), 2,3 ms avg latency, 621,0 ms max latency.
2510 records sent, 498,4 records/sec (0,48 MB/sec), 2,0 ms avg latency, 633,0 ms max latency.
2363 records sent, 472,3 records/sec (0,45 MB/sec), 2,1 ms avg latency, 270,0 ms max latency.
2412 records sent, 482,3 records/sec (0,46 MB/sec), 2,1 ms avg latency, 226,0 ms max latency.
3275 records sent, 654,9 records/sec (0,62 MB/sec), 1,5 ms avg latency, 776,0 ms max latency.
2406 records sent, 478,2 records/sec (0,46 MB/sec), 2,1 ms avg latency, 376,0 ms max latency.
2670 records sent, 530,7 records/sec (0,51 MB/sec), 1,9 ms avg latency, 790,0 ms max latency.
2645 records sent, 517,7 records/sec (0,49 MB/sec), 1,9 ms avg latency, 612,0 ms max latency.
2511 records sent, 502,2 records/sec (0,48 MB/sec), 2,0 ms avg latency, 458,0 ms max latency.
2768 records sent, 553,4 records/sec (0,53 MB/sec), 1,8 ms avg latency, 843,0 ms max latency.
2425 records sent, 484,4 records/sec (0,46 MB/sec), 2,0 ms avg latency, 658,0 ms max latency.
2650 records sent, 528,4 records/sec (0,50 MB/sec), 1,9 ms avg latency, 747,0 ms max latency.
2575 records sent, 515,0 records/sec (0,49 MB/sec), 1,9 ms avg latency, 401,0 ms max latency.
2677 records sent, 528,0 records/sec (0,50 MB/sec), 1,9 ms avg latency, 440,0 ms max latency.
2835 records sent, 565,1 records/sec (0,54 MB/sec), 1,8 ms avg latency, 717,0 ms max latency.
2088 records sent, 417,1 records/sec (0,40 MB/sec), 2,4 ms avg latency, 759,0 ms max latency.
3002 records sent, 600,3 records/sec (0,57 MB/sec), 1,7 ms avg latency, 391,0 ms max latency.
2707 records sent, 528,6 records/sec (0,50 MB/sec), 1,9 ms avg latency, 607,0 ms max latency.
2544 records sent, 495,7 records/sec (0,47 MB/sec), 2,0 ms avg latency, 292,0 ms max latency.
2824 records sent, 552,6 records/sec (0,53 MB/sec), 1,8 ms avg latency, 509,0 ms max latency.
2723 records sent, 543,9 records/sec (0,52 MB/sec), 1,8 ms avg latency, 342,0 ms max latency.
2345 records sent, 458,3 records/sec (0,44 MB/sec), 2,2 ms avg latency, 654,0 ms max latency.
2860 records sent, 570,2 records/sec (0,54 MB/sec), 1,7 ms avg latency, 708,0 ms max latency.
2469 records sent, 489,2 records/sec (0,47 MB/sec), 2,0 ms avg latency, 529,0 ms max latency.
2773 records sent, 534,2 records/sec (0,51 MB/sec), 1,9 ms avg latency, 447,0 ms max latency.
2379 records sent, 468,8 records/sec (0,45 MB/sec), 2,1 ms avg latency, 272,0 ms max latency.
2590 records sent, 515,6 records/sec (0,49 MB/sec), 1,9 ms avg latency, 294,0 ms max latency.
2487 records sent, 456,2 records/sec (0,44 MB/sec), 2,2 ms avg latency, 619,0 ms max latency.
80000 records sent, 517,193450 records/sec (0,49 MB/sec), 1,92 ms avg latency, 2242,00 ms max latency, 0 ms 50th, 10 ms 95th, 32 ms 99th, 230 ms 99.9th.

Metric Name                                                                          Value
app-info:commit-id:{client-id=producer-1}                                          : d4284cbebb6f0a4c
app-info:start-time-ms:{client-id=producer-1}                                      : 1592790167863
app-info:version:{client-id=producer-1}                                            : 2.3.1
kafka-metrics-count:count:{client-id=producer-1}                                   : 126,000
producer-metrics:batch-size-avg:{client-id=producer-1}                             : 1075,000
producer-metrics:batch-size-max:{client-id=producer-1}                             : 1075,000
producer-metrics:batch-split-rate:{client-id=producer-1}                           : 0,000
producer-metrics:batch-split-total:{client-id=producer-1}                          : 0,000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                     : 33554432,000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                      : 0,000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                     : 0,000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                         : 33554432,000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                      : 0,000
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                 : 0,000
producer-metrics:compression-rate-avg:{client-id=producer-1}                       : 1,000
producer-metrics:connection-close-rate:{client-id=producer-1}                      : 0,062
producer-metrics:connection-close-total:{client-id=producer-1}                     : 10,000
producer-metrics:connection-count:{client-id=producer-1}                           : 4,000
producer-metrics:connection-creation-rate:{client-id=producer-1}                   : 0,064
producer-metrics:connection-creation-total:{client-id=producer-1}                  : 14,000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                 : 0,000
producer-metrics:failed-authentication-total:{client-id=producer-1}                : 0,000
producer-metrics:failed-reauthentication-rate:{client-id=producer-1}               : 0,000
producer-metrics:failed-reauthentication-total:{client-id=producer-1}              : 0,000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                         : 30,966
producer-metrics:incoming-byte-total:{client-id=producer-1}                        : 6966,000
producer-metrics:io-ratio:{client-id=producer-1}                                   : 0,008
producer-metrics:io-time-ns-avg:{client-id=producer-1}                             : 7163,511
producer-metrics:io-wait-ratio:{client-id=producer-1}                              : 0,975
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                        : 918249,373
producer-metrics:io-waittime-total:{client-id=producer-1}                          : 148354812900,000
producer-metrics:iotime-total:{client-id=producer-1}                               : 1402924422,000
producer-metrics:metadata-age:{client-id=producer-1}                               : 31,485
producer-metrics:network-io-rate:{client-id=producer-1}                            : 524,129
producer-metrics:network-io-total:{client-id=producer-1}                           : 80049,000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                         : 605242,178
producer-metrics:outgoing-byte-total:{client-id=producer-1}                        : 92389699,000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                  : 0,000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                  : 0,000
producer-metrics:reauthentication-latency-avg:{client-id=producer-1}               : NaN
producer-metrics:reauthentication-latency-max:{client-id=producer-1}               : NaN
producer-metrics:record-error-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-error-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                      : 0,088
producer-metrics:record-queue-time-max:{client-id=producer-1}                      : 707,000
producer-metrics:record-retry-rate:{client-id=producer-1}                          : 0,062
producer-metrics:record-retry-total:{client-id=producer-1}                         : 10,000
producer-metrics:record-send-rate:{client-id=producer-1}                           : 524,028
producer-metrics:record-send-total:{client-id=producer-1}                          : 80010,000
producer-metrics:record-size-avg:{client-id=producer-1}                            : 1091,000
producer-metrics:record-size-max:{client-id=producer-1}                            : 1091,000
producer-metrics:records-per-request-avg:{client-id=producer-1}                    : 1,000
producer-metrics:request-latency-avg:{client-id=producer-1}                        : NaN
producer-metrics:request-latency-max:{client-id=producer-1}                        : NaN
producer-metrics:request-rate:{client-id=producer-1}                               : 524,041
producer-metrics:request-size-avg:{client-id=producer-1}                           : 1154,749
producer-metrics:request-size-max:{client-id=producer-1}                           : 1155,000
producer-metrics:request-total:{client-id=producer-1}                              : 80025,000
producer-metrics:requests-in-flight:{client-id=producer-1}                         : 1,000
producer-metrics:response-rate:{client-id=producer-1}                              : 0,107
producer-metrics:response-total:{client-id=producer-1}                             : 24,000
producer-metrics:select-rate:{client-id=producer-1}                                : 1061,779
producer-metrics:select-total:{client-id=producer-1}                               : 158196,000
producer-metrics:successful-authentication-no-reauth-total:{client-id=producer-1}  : 0,000
producer-metrics:successful-authentication-rate:{client-id=producer-1}             : 0,000
producer-metrics:successful-authentication-total:{client-id=producer-1}            : 0,000
producer-metrics:successful-reauthentication-rate:{client-id=producer-1}           : 0,000
producer-metrics:successful-reauthentication-total:{client-id=producer-1}          : 0,000
producer-metrics:waiting-threads:{client-id=producer-1}                            : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--2}   : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}    : 18,618
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-3}    : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-6}    : 9,177
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--2}  : 579,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}   : 2922,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-3}   : 1737,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-6}   : 1728,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--2}   : 0,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}    : 201071,414
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-3}    : 203138,734
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-6}    : 201008,429
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--2}  : 67,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}   : 30823534,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-3}   : 30908845,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-6}   : 30657253,000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--2}  : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}   : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-3}   : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-6}   : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--2}  : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}   : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-3}   : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-6}   : NaN
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--2}         : 0,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}          : 174,124
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-3}          : 175,880
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-6}          : 174,036
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--2}     : NaN
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}      : 1154,623
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-3}      : 1154,815
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-6}      : 1154,810
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--2}     : NaN
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}      : 1155,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-3}      : 1155,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-6}      : 1155,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--2}        : 2,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}         : 26700,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-3}         : 26771,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-6}         : 26552,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--2}        : 0,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}         : 0,064
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-3}         : 0,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-6}         : 0,031
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--2}       : 2,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}        : 10,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-3}        : 6,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-6}        : 6,000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=test-topic}          : 563297,483
producer-topic-metrics:byte-total:{client-id=producer-1, topic=test-topic}         : 85999639,000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=test-topic}   : 1,000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=test-topic}  : 0,062
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=test-topic} : 10,000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=test-topic}   : 524,028
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=test-topic}  : 80010,000
Produce Time: 154.68
[22:45:23] Ignite node stopped OK [uptime=00:02:32.048]
Aplication time: 155.919
*****Produção finalizada, esperando 180 s para buscar WM*****
Water mark: 400067